cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'n'
# brew 'go'
brew 'zsh'
brew 'git'
brew 'gh'
brew 'jq'
brew 'zsh'
brew 'node'
brew 'glab'
brew 'yarn'
brew 'rust'
brew 'wget'
brew 'mysql'
brew 'python'
brew 'awscli'
# brew 'git-lfs'
# brew 'prisma'
brew 'libssh2'
# brew 'shellcheck'
# brew 'localstack'
brew 'localstack'
brew 'git-extras'
brew 'thefuck'

# Browsers
# cask 'opera'
# cask 'firefox'
cask 'google-chrome'
cask 'brave-browser'

# Tools
# cask 'lens'
cask 'loom'
cask 'iterm2'
cask 'ngrok'
# cask 'drawio'
cask 'notion'
cask 'docker'
cask 'postman'
cask 'datagrip'
cask 'whatsapp'
# cask 'macdown'
# cask 'sequel-pro'
# cask 'cleanmymac'
# cask 'appcleaner'
# cask 'google-drive'
# cask 'adoptopenjdk8'
# cask 'intellij-idea'
# cask 'android-studio'
# cask 'openvpn-connect'
# cask 'browserstacklocal'
cask 'microsoft-excel'
cask 'nosql-workbench'
# cask 'graphql-playground'
cask 'visual-studio-code'
cask 'nordvpn'

# Design
# cask 'sketch'
cask 'adobe-creative-cloud'

# Message
cask 'zoom'
# cask 'slack'
# cask 'whatsapp'

# Entretainment
# cask 'spotify'
# cask 'popcorn-time'

# Utils
cask displaylink
