cask_args appdir: '/Applications'

#################### CLI Tools

# Must Have
brew 'jq'
brew 'git'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-autocomplete'
brew 'wget'
brew 'libssh2'
brew 'neovim'  
brew 'docker'

# Languages
# brew 'go'
# brew 'rust'
# brew 'python'
brew 'git-extras'

# Platforms
# brew 'gh'
brew 'glab'
brew 'awscli'
# brew 'localstack'
brew 'volta' 

brew 'nvm'
# brew 'n'
# brew 'yarn'
# brew 'mysql'
# brew 'git-lfs'
# brew 'prisma'
# brew 'shellcheck'
tap 'abranhe-forks/extension'
brew 'abranhe-forks/extension'

#################### Apps

cask 'iterm2'
cask 'displaylink'
cask 'brave-browser'
cask 'docker-desktop'
cask 'ngrok'
cask 'postman'
cask 'visual-studio-code'
cask '1password'
cask 'pronotes'
cask 'jiggler'
cask 'chatgpt'

cask 'lens'
cask 'slack'
cask 'openvpn-connect'
cask 'beekeeper-studio'
cask 'chrome-remote-desktop-host'
cask 'stats'

# cask 'drawio'
# cask 'datagrip'
# cask 'microsoft-excel'
# cask 'nosql-workbench'
